export const phase1 = [
  {
    title: "셀피의 시작, 커뮤니티 오픈",
    content: "홈페이지, 디스코드 커뮤니티를 오픈한다.",
  },
  {
    title: "대한민국에서 잘 나간다는 셀럽들에게 침투하라!",
    content: "PFP NFT X 10,000 Celpi 분양",
  },
  {
    title: "셀피를 사랑하도록 만든다. 대한민국은 셀피 전성시대!",
    content: "전국 티비광고, 버스광고 실현.",
  },
];

export const phase2 = [
  {
    title: "세뇌된 셀럽들이 스스로 셀피를 알리도록 하자.",
    content: "트위터, 인스타그램 등 SNS 계정에 PFP 셀피 NFT를 등록시키면 츄르N토큰 지급. 국내외 연예인들과 다양한 컨셉의 미디어 콜라보 적극적인 Meme화",
  },
  {
    title: "더 큰 무리를 형성하기 위해 다른 종들과 연합한다.",
    content: "(NFT프로젝트와 역대급 콜라보레이션 진행) 힘의 균형을 깨기위해 동맹군을 결성한다. 협업 NFT 프로젝트 진행 - 새로운 유니버스 등장.",
  },
];

export const phase3 = [
  {
    title: "메타버스 셀피의 영역 확대",
    content: "더 샌드박스 내 캣타워 구축 \n 셀피랜드에 들어가기 위해선, 메타버스에 들어갈 수 있는 셀피로 차원이동준비.",
  },
  {
    title: "이것이 셀피 패밀리의 힘!",
    content: "셀피와 셀피와의 브리딩(Breeding Fee 발생), 오리지날 셀피 NFT 등장.",
  },
];

export const phase4 = [
  {
    title: "츄르N토큰 등장 (우리에겐 우리만의 에너지 부스터가 필요하다)",
    content:
      "화성과 지구의 중력은 다르다. 지구에서의 활동은 더 많은 에너지를 소비한다. 셀피들만의 츄르가 필요하다. 셀피를 움직이게 하는 원동력 츄르 등장! 츄르N토큰 발행 - 토큰 사용처, 토큰 생태계 정식 발표.",
  },
  {
    title: "머스크의 지원이 만만치 않다. 더 강력한 셀피가 필요하다.",
    content:
      "토큰 선순환, NFT 가치 보존을 위하여 민팅 후 셀피를 n개 이상 보유한 홀더들에게 뮤턴트 츄르 NFT 화리권을 지급한다. (기존 셀피 + 뮤턴트 츄르 NFT 소각)",
  },
];

export const phase5 = [
  {
    title: "셀피 집사들아 집결하라! Mining / DeFi / Governance 개발 및 정식 런칭.",
  },
  {
    title: "대형 브랜드에게 협업을 제안한다.",
    content: "IP콜라보를 진행, 셀피 굿즈샵 오픈, 프라이빗 연말파티 초대권 등",
  },
  {
    title: "메타버스에 P2E 게임 개발을 시도한다.",
    content: "게임 공식 유튜브 채널을 개설한다. 알파 티져 영상을 공개한다. 개발 영상을 공개한다.",
  },
];

export const phase6 = [
  {
    title: "승부타임이 다가온다. 막강한 화력을 지원한다. (N = 5/10/15)",
    content:
      "셀피 NFT n개 이상 홀더들에게 파트너사들의 다양한 이벤트 지원 \n 셀피 NFT n개 이상 홀더들에게 비율에 맞춰 마켓플레이스 거래수수료 에어드랍 \n 셀피 NFT n개 이상 홀더들에게 화끈한 츄르N토큰 에어드랍",
  },
  {
    title: "머스크에 결투를 신청한다. 셀피의 운명은?",
    content: "2.0은 지구에 메타버스를 정복",
  },
];

export const sec7arr = [
  [
    {
      title: "셀피의 시작, 커뮤니티 오픈",
      content: "홈페이지, 디스코드 커뮤니티를 오픈한다.",
    },
    {
      title: "대한민국에서 잘 나간다는 셀럽들에게 침투하라!",
      content: "PFP NFT X 10,000 Celpi 분양",
    },
    {
      title: "셀피를 사랑하도록 만든다. 대한민국은 셀피 전성시대!",
      content: "전국 티비광고, 버스광고 실현.",
    },
  ],
  [
    {
      title: "세뇌된 셀럽들이 스스로 셀피를 알리도록 하자.",
      content: "트위터, 인스타그램 등 SNS 계정에 PFP 셀피 NFT를 등록시키면 츄르N토큰 지급. \n국내외 연예인들과 다양한 컨셉의 미디어 콜라보 적극적인 Meme화",
    },
    {
      title: "더 큰 무리를 형성하기 위해 다른 종들과 연합한다.",
      content: "(NFT프로젝트와 역대급 콜라보레이션 진행) 힘의 균형을 깨기위해 동맹군을 결성한다. 협업 NFT 프로젝트 진행 - 새로운 유니버스 등장.",
    },
  ],
  [
    {
      title: "메타버스 셀피의 영역 확대",
      content: "더 샌드박스 내 캣타워 구축 \n셀피랜드에 들어가기 위해선, 메타버스에 들어갈 수 있는 셀피로 차원이동준비.",
    },
    {
      title: "이것이 셀피 패밀리의 힘!",
      content: "셀피와 셀피와의 브리딩(Breeding Fee 발생), 오리지날 셀피 NFT 등장.",
    },
  ],
  [
    {
      title: "츄르N토큰 등장 (우리에겐 우리만의 에너지 부스터가 필요하다)",
      content:
        "화성과 지구의 중력은 다르다. 지구에서의 활동은 더 많은 에너지를 소비한다. 셀피들만의 츄르가 필요하다. \n셀피를 움직이게 하는 원동력 츄르 등장! 츄르N토큰 발행 \n- 토큰 사용처, 토큰 생태계 정식 발표.",
    },
    {
      title: "머스크의 지원이 만만치 않다. 더 강력한 셀피가 필요하다.",
      content:
        "토큰 선순환, NFT 가치 보존을 위하여 민팅 후 셀피를 n개 이상 보유한 홀더들에게 뮤턴트 츄르 NFT 화리권을 지급한다. \n(기존 셀피 + 뮤턴트 츄르 NFT 소각)",
    },
  ],
  [
    {
      title: "셀피 집사들아 집결하라! Mining / DeFi / Governance 개발 및 정식 런칭.",
    },
    {
      title: "대형 브랜드에게 협업을 제안한다.",
      content: "IP콜라보를 진행, 셀피 굿즈샵 오픈, 프라이빗 연말파티 초대권 등",
    },
    {
      title: "메타버스에 P2E 게임 개발을 시도한다.",
      content: "게임 공식 유튜브 채널을 개설한다. 알파 티져 영상을 공개한다. 개발 영상을 공개한다.",
    },
  ],
  [
    {
      title: "승부타임이 다가온다. 막강한 화력을 지원한다. (N = 5/10/15)",
      content:
        "셀피 NFT n개 이상 홀더들에게 파트너사들의 다양한 이벤트 지원 \n셀피 NFT n개 이상 홀더들에게 비율에 맞춰 마켓플레이스 거래수수료 에어드랍 \n셀피 NFT n개 이상 홀더들에게 화끈한 츄르N토큰 에어드랍",
    },
    {
      title: "머스크에 결투를 신청한다. 셀피의 운명은?",
      content: "2.0은 지구에 메타버스를 정복",
    },
  ],
];

export const phaseFunc = (num) => {
  sec7arr.map((v, i) => {
    v.map((value, index) => {
      if (num < 30) {
        num += 5;
      } else if (num >= 30) {
        // 홈페이지보니까 30 이상이면 +10 함
        num += 10;
      }
      value.percent = num;
    });
  });
  return sec7arr;
};
